/*
 *	widget 語言包配置
 *	author		yulei@addcn.com
 *	updateTime	2015-03-31
 */
define(function (require, exports, module){
	module.exports = {
    "close":"關閉",
    "sure":"確認",
    "reset":"重設",
    "login" : "登入會員",

    "region":["全香港","港島","九龍","新界","離島","海外"],

    "section":["","鰂魚涌","太古/西灣河","筲箕灣","柴灣","壽臣山","淺水灣","赤柱/大潭","南區/石澳","香港仔","薄扶林/海怡","貝沙灣","西半山","西區","上環/中環","中半山/金鐘","灣仔","銅鑼灣","跑馬地","天后/大坑","北角","山頂","油塘/藍田", "觀塘/秀茂坪", "九龍灣", "鑽石山/彩虹", "康城/清水灣", "將軍澳", "調景嶺", "九龍城", "土瓜灣","佐敦/尖沙咀","九龍站","紅磡/黃埔","深水埗","長沙灣","荔枝角","美孚","大角咀","奧運","九龍塘","石硤尾","何文田/京士柏","黃大仙/新蒲崗","太子","旺角/油麻地","西貢","馬鞍山","大埔/太和","沙田/火炭","深井","荃灣","葵涌","青衣","元朗","","天水圍","屯門","粉嶺","上水","愉景灣","東涌","馬灣","大嶼山","坪洲","南丫島","長洲","大窩口","珠海","深圳","東莞","惠州","廣州","澳門","台灣","日本","韓國","新加坡","馬來西亞","泰國","英國","美國","加拿大","澳洲","中山","德國","江門","海口","成都","佛山"],

    "subway":["","港島綫", "觀塘綫", "荃灣綫", "將軍澳綫", "東涌綫及迪士尼綫", "東鐵綫", "馬鞍山綫", "西鐵綫", "機場快綫","南港島綫"],

    "subway_station":["", "上環", "中環", "金鐘", "灣仔", "銅鑼灣", "天后", "炮台山", "北角", "鰂魚涌", "太古", "西灣河", "筲箕灣", "杏花邨", "柴灣", "油麻地", "旺角", "太子", "石硤尾", "九龍塘", "樂富", "黃大仙", "鑽石山", "彩虹", "九龍灣", "牛頭角", "觀塘", "藍田", "油塘", "調景嶺", "中環", "金鐘", "尖沙咀", "佐敦", "油麻地", "旺角", "太子", "深水埗", "長沙灣", "荔枝角", "美孚", "荔景", "葵芳", "葵興", "大窩口", "荃灣", "北角", "鰂魚涌", "油塘", "調景嶺", "將軍澳", "坑口", "寶琳", "康城", "香港", "九龍", "奧運", "南昌", "荔景", "青衣", "東涌", "欣澳", "迪士尼", "紅磡", "旺角東", "九龍塘", "大圍", "沙田", "火炭", "馬場", "大學", "大埔墟", "太和", "粉嶺", "上水", "落馬洲", "羅湖", "大圍", "車公廟", "沙田圍", "第一城", "石門", "大水坑", "恆安", "馬鞍山", "烏溪沙", "紅磡", "尖東", "柯士甸", "南昌", "美孚", "荃灣西", "錦上路", "元朗", "朗屏", "天水圍", "兆康", "屯門", "香港", "九龍", "青衣", "機場", "博覽館", "堅尼地城", "香港大學", "西營盤","金鐘","海洋公園","黃竹坑","利東","海怡半島","黃埔","何文田"],

    "areabox":{
      "section":"選擇地區",
      "mrt":"選擇港鐵"
    },
    
		"area":{
      "s_region":["","港島東","港島南","港島西","港島北","九龍東","九龍南","九龍西","九龍北","新界東","新界南","新界西","新界北","離島","海外"]
    },

    "school":{
      "secondaryData":["","中西區", "灣仔區", "東區", "南區", "油尖旺區", "九龍城區", "深水埗區", "黃大仙區", "觀塘區", "北區", "大埔區", "沙田區", "西貢區", "荃灣區", "葵青區", "屯門區", "元朗區", "離島區"], 
      "choiceschool":"選擇校網",
      "numschool":"號校網"
    },

    "datepicker":{
      "days": ["星期日", "星期一", "星期二", "星期三", "星期四", "星期五", "星期六", "星期天"],
      "daysShort": ["周日", "周一", "周二", "周三", "周四", "周五", "周六"],
      "daysMin": ["日", "一", "二", "三", "四", "五", "六"],
      "months": ["一月", "二月", "三月", "四月", "五月", "六月", "七月", "八月", "九月", "十月", "十一月", "十二月"],
      "monthsShort": ["一月", "二月", "三月", "四月", "五月", "六月", "七月", "八月", "九月", "十月", "十一月", "十二月"]
    },

    "validform":{
      "tit" : "提示信息",
      "notNull" : "不能為空！",
      "six_sixteen" : "请填写6到16位任意字符！",
      "num" : "請填寫數字！",
      "num_six_sixteen" : "请填写6到16位数字！",
      "notS" : "不能输入特殊字符！",
      "s_six_eighteen" : "请填写6到18位字符！",
      "zipCode" : "请填写邮政编码！",
      "phoneNum" : "请填写手机号码！",
      "email" : "郵箱格式錯誤，請重新填寫！",
      "URL" : "请填写网址！",
      "def":"请填写正确信息！",
      "undef":"datatype未定义！",
      "reck":"两次输入的内容不一致！",
      "c":"正在检测信息…",
      "s":"请{填写|选择}{0|信息}！",
      "v":"所填信息没有经过验证，请稍后…",
      "p":"正在提交数据…"
    },

    "validform_data":{
      "phone":"手機號碼格式錯誤，我們僅支持香港、大陸、台灣手機號碼，請確認。",
      "unequal":"值不能相等！",
      "notvalued":"不能含有特定值！",
      "phone_eight" : "請輸入手機號碼，不支持固定電話。",
      "phone_ten" : "你輸入的手機號碼格式錯誤，請檢查。正確格式如：0910123456",
      "phone_eleven" : "你輸入的手機號碼格式錯誤，請檢查。正確格式如：13012345678",
      "must_min" : "請至少選擇",
      "must_max" : "最多只能選擇",
      "unit" : "項！"
    },

    "handler" : {
      "flashWarn" : "非常抱歉，“上傳照片模組”載入失敗，您需要安裝或更新Adobe Flash Player。訪問 <a href='http://www.adobe.com/shockwave/download/download.cgi?P1_Prod_Version=ShockwaveFlash' target='_blank'>Adobe官網</a> 獲取最新的 Flash Player.",
      "photoNum" : "照片數已經超過限制，現還可以上傳",
      "photoUnit" : "張",
      "limitWarn" : "超出了限定大小",
      "limitZero" : "不能上傳0字節的文件.",
      "failFile" : "無效的文件類型.",
      "unKnown" : "未知錯誤 0000",
      "delImg" : "刪除圖片",
      "imgDes" : "圖片描述",
      "delWarn" : "您確定要刪除圖片嗎？",
      "fileType" : "圖片格式"
    }

    
	}
})


